import requests
import time


class Internlm2:
    def __init__(self):
        pass

    def __call__(self,
                 prompt,
                 core_pod_ip='10.119.60.184',
                 temperature=0.001,
                 top_p=0.9,
                 max_new_tokens=256,
                 repetition_penalty=1.05,
                 stream=False,
                 *args, **kwargs):

        server = "http://101.230.144.204:8008/api/generate"
        headers = {"Content-Type": "application/json"}
        endpoint = f"http://{core_pod_ip}:2345/generate"  # cci tgi-gpu8

        request_body = {
            "endpoint": endpoint,
            "inputs": prompt,
            "parameters": {
                "temperature": temperature,
                "top_p": top_p,
                "do_sample": True,
                "max_new_tokens": max_new_tokens,
                "top_k": 1,
                "repetition_penalty": repetition_penalty,
                "stop": [
                #  "</s>",
                #  "User:",
                ]
            }
        }
        response = requests.post(server, headers=headers, json=request_body, stream=stream)
        # print(response)
        time.sleep(0.1)
        if response.status_code == 200:
            try:
                res = response.json()
            except:
                raise Exception('Response can not be parsed !')

            try:
                return res["generated_text"]
            except:
                return "generated_text"
        else:
            raise Exception('No response returned by SenseNova !')


if __name__=='__main__':
    prompt = """### 只通过sqlite SQL查询回答问题，不做任何解释。
### Sqlite SQL表及其属性：
#
# 积分报表信息(`工号`, `姓名`, `机构`, `部门`, `岗位`, `考核积分`);
# 员工点位信息(`工号`, `时间`, `经度`, `纬度`, `地址`, `备注`);
# 预警信息(`预警流水号`, `工号`, `员工姓名`, `状态`, `下发时间`, `逾期时间(含)`, `机构`, `预警时间`, `预警是否准确`, `部门`, `预警名称`, `预警级别`, `首次反馈时间`, `反馈时间`, `核查情况`, `是否超时`, `流程节点`, `是否存在问题`, `风险等级`, `回退次数`, `疑点类型`, `处置措施`);
# 离职人员名单(`工号`, `姓名`, `机构`, `部门`, `岗位`, `员工状态`, `离职日期`, `员工类别`);
# 访客记录(`上传人工号 `, `上传人姓名`, `组织机构`, `上传时间`, `员工位置`, `访客类型`, `备注信息`, `陪同人上传`, `直属上级名称`, `直属上级工号`, `是否被阅`, `被阅时间`, `是否T+1日内查阅`, `系统筛查结果`, `原因`, `手工筛查结果`, `备注`, `设备ID`, `客户类型`, `客户名称`, `营销产品`, `条线`, `渠道相关`, `陪同人`, `特殊类型`, `异常类型`, `异常原因`, `上传人工号`);
# 打卡记录(`工号`, `姓名`, `机构`, `部门`, `岗位`, `打卡日期`, `打卡时间`, `考勤机编号`, `打卡类型`, `补签卡`, `补签原因`, `上传时间`)
#
### 以下是有关数据库引用的一些示例数据信息。
#
# 积分报表信息(`工号`[000008,000008,000048], `姓名`[龚琛琛,龚琛琛,徐君], `机构`[三江支行,段塘支行,宁穿支行], `部门`[海曙支行三江支行个人银行部,海曙支行段塘支行个人银行部,鄞州中心区支行宁穿支行行长室], `岗位`[个人银行业务经理,贵宾理财经理,支行行长], `考核积分`[.2,.25,1]);
# 员工点位信息(`工号`[xxxxxx,xxxxxx,xxxxxx], `时间`[2024-02-22 09:14:27,2024-02-22 09:14:28,2024-02-22 09:14:29], `经度`[121.50728,121.50728,121.50727], `纬度`[31.24172,31.241716,31.24173], `地址`[上海市浦东新区银城中路8号靠近海银金融中心,上海市浦东新区银城中路9号靠近海银金融中心,上海市浦东新区银城中路10号靠近海银金融中心], `备注`[APP重启Wif定位结果:正常获取定位度:30.02G网络 当前网络正常使用,Wif定位结果:正常获联定位精度:3002G网络当前网络正常使用,Wi定位结果正常获取定位精度:30.02G网络当前网络正常使用]);
# 预警信息(`预警流水号`[20230629010000001611,20230629010000000793,20230628010000000034], `工号`[190582,225136,152946], \
`员工姓名`[王桢,李小雪,陈瑞娇], `状态`[待阅,待阅,待阅], `下发时间`[2023-06-30 00:00:00,2023-06-30 00:00:01,2023-06-29 00:00:02],\
 `逾期时间(含)`[,,], `机构`[上海张江支行,宁银消金,上海张江支行], `预警时间`[2023-06-30 00:00:00,2023-06-30 00:00:01,2023-06-29 00:00:02], `预警是否准确`[,,], `部门`[支行财富管理部,业务部-业务三部,支行公司业务二部], `预警名称`[访客对象为员工关系人,上传访客时间间隔过短,特殊时段访客], `预警级别`[黄,黄,黄], `首次反馈时间`[,,], `反馈时间`[,,], `核查情况`[,,], `是否超时`[否,否,否], `流程节点`[,,], `是否存在问题`[否,否,否], `风险等级`[无风险,无风险,无风险], `回退次数`[0,0,0], `疑点类型`[,,], `处置措施`[,,]);
# 离职人员名单(`工号`[182128,170687,183831], `姓名`[张鸿雁,沈佳晨,司慧], `机构`[上海分行,上海分行,上海分行], `部门`[上海分行风险管理部-回访部,上海分行个人银行总部-总经理室,上海分行财富管理部-投资顾问部], `岗位`[回访岗,个人银行总部副总经理,投资顾问尚], `员工状态`[离职,离职,离职], `离职日期`[2023-10-23 00:00:00,2023-09-08 00:00:00,2023-04-06 00:00:00], `员工类别`[正式工,正式工,正式工]);
# 访客记录(`上传人工号 `[None,None,None], `上传人姓名`[何佳凝,王扶摇,杨维诚], `组织机构`[普陀支行个人,信用卡中心-业务,普陀支行个人], \
`上传时间`[2023-03-31 21:18:05,2023-03-31 20:50:05,2023-03-31 20:48:56], `员工位置`[普陀区岚皋路567号,真如镇街道铜川路,川路68号弘基时尚], \
`访客类型`[新客户营销,其它,新客户营销], `备注信息`[,,], `陪同人上传`[否,否,否], `直属上级名称`[李珊珊,姚瑶,李姗姗], `直属上级工号`[180205,190969,180205], `是否被阅`[是,是,是], `被阅时间`[2023-03-31 21:18:05,2023-03-31 20:50:05,2023-03-31 20:48:56], `是否T+1日内查阅`[是,是,是], `系统筛查结果`[不匹配,不匹配,不匹配], `原因`[有记录无安排,有记录无安排,有记录无安排], `手工筛查结果`[未筛查,未筛查,未筛查], `备注`[,,], `设备ID`[8735b6ae8,41a7-a506,032359c2], `客户类型`[个人,,个人], `客户名称`[张女士,,张辉], `营销产品`[按揭,,按揭], `条线`[个人银行业务,信用卡业务,个人银行业务], `渠道相关`[,,], `陪同人`[,,], `特殊类型`[正常,正常,正常], `异常类型`[工作时间段访,工作时间段访,工作时间段访], `异常原因`[,,], `上传人工号`[225846,221841,226781]);
# 打卡记录(`工号`[160659,160659,050148], `姓名`[唐希龙,唐希龙,方圆], `机构`[上海分行,上海分行,上海分行], `部门`[行长室,行长室,行长室], `岗位`[分行副行长,分行副行长,分行副行长], `打卡日期`[2024年2月1日,2024年2月1日,2024年2月1日], `打卡时间`[08:04:50,18:48:49,08:02:48], `考勤机编号`[11.21.148.22,11.21.148.23,11.21.148.24], `打卡类型`[人脸考勤,人脸考勤,人脸考勤], `补签卡`[,,], `补签原因`[,,], `上传时间`[2024年2月1日8:04:50,2024年2月1日18:48:49,2024年2月1日8:02:48])
#
### 以下是生成SQL语句需要注意的地方：
#
# 注意，上下班时间可以通过查询打卡时间来确定；
# 注意，10:00在查询时需要用“10:00:00”表示；
# 注意，查询员工需要查询员工的姓名或者是上传人姓名；
# 注意，问题中出现比如“2021年5月份期间”，则需表示为“2021-05-01 00:00:00到2021-05-31 23:59:59”。
#
### 问题是: 查询下哪个员工下班时间最晚？
### SQL: """
    llm=Internlm2()
    print(llm(prompt, max_new_tokens=512))
    # from multiprocessing import Pool
    # import time
    #
    # stms = time.time()
    # pool = Pool(5)
    # # llm = Internlm2()
    # result = list(pool.map(llm, '请用一句话解释万有引力'))
    # print(len(result))
    # print(result)
